# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  # operations on l4
  - [-1, 1, Conv, [2048, 1, 1]]  # 10
  
  # operations on l3
  - [5, 1, Conv, [1024, 1, 1]]  # 11
  - [[-1,9], 1, UpsampleAdd, [1]]
  - [-1, 1, Conv, [1024, 1, 1]]  # 13

  # operations on l2
  - [3, 1, Conv, [512, 1, 1]]  # 14
  - [[-1, 13], 1, UpsampleAdd, [1]]  # 15
  - [-1, 1, Conv, [512, 1, 1]]  # 16

  # Detection head
  - [[10, 13, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)
