# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

backbone:
  # [from, repeats, module, args]
  # HGNetV2 backbone
  - [-1, 1, HGStem, [32, 48]]                     # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]                # 1-stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]        # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]                # 3-stage 2 - Used in RT-DETR 2nd

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]        # 4-P3/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]] # 5-cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 6
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 7-stage 3 - Used in RT-DETR 1st. RT-DETR uses 1024 channels in P3, YOLOv8 uses 512. It is incompatible right now

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]       # 8-P4/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # 9-stage 4

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 10
  - [[-1, 7], 1, Concat, [1]]                     # 11-cat backbone P4
  - [-1, 3, C2f, [512]]                           # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 13
  - [[-1, 3], 1, Concat, [1]]                     # 14-cat backbone P3
  - [-1, 3, C2f, [256]]                           # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                    # 17-cat head P4
  - [-1, 3, C2f, [512]]                           # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                    # 19
  - [[-1, 9], 1, Concat, [1]]                     # 20-cat head P5
  - [-1, 3, C2f, [1024]]                          # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]               # Detect(P3, P4, P5)
